app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
    def index
        artists = Artist.all