app/controllers/arts_controller.rb

SELECT "arts".* FROM "arts"
---
    def index
        @arts = Art.all

SELECT "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        art = Art.find(params[:id])